codeIgniter/app/Models/UsersModel.php

    public function getUser($userName = false)
    {
        if ($userName === false) {
            return $this->findAll();
        }

        return $this->where(['userName' => $userName])->first();
---
SELECT *
FROM `user`
SELECT *
FROM `user`
WHERE `userName` = 'eifrigerSpecht28'
 LIMIT 1